---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentControl
source: html/9861ca80-a317-588b-4ae6-582914ae618d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentControl Property

While making curved beam type "[Type Name]" some Control elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentControl { get; }
```